ZeshuLiu/esp32_keyboard/Keyboard_code/poker_keyboard/build/sketch/poker_keyboard.ino.cpp
#line 1 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_keyboard.ino"
# include "poker_keyboard.h"
# include "poker_bt.h"
# include <BleKeyboard.h>
# include <Wire.h>
# include "keyboard_self.h"
# include <Arduino.h>
# include "pcf8575.h"
# include "scan.h"
# include "joker_usb.h"
# include "save.h"
# include "Seg_disp.h"
# include "oled_buff.h"

#line 14 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_keyboard.ino"
void setup();
#line 60 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_keyboard.ino"
void loop();
#line 3 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\Seg_disp.ino"
void init_seg();
#line 11 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\joker_usb.ino"
void joker_usb_test();
#line 27 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\joker_usb.ino"
void joker_usb_work(void *pvParameters);
#line 267 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\joker_usb.ino"
void words_change(uint8_t word_name, bool stat);
#line 287 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\joker_usb.ino"
bool joker_usb_start();
#line 309 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\joker_usb.ino"
void joker_usb2bt();
#line 8 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\keyboard_self.ino"
void keyboard_setup();
#line 35 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\keyboard_self.ino"
void open_inter_led();
#line 39 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\keyboard_self.ino"
void close_inter_led();
#line 44 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\keyboard_self.ino"
void cnt_work(void *pvParameters);
#line 72 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\keyboard_self.ino"
bool cnt_start();
#line 83 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\keyboard_self.ino"
void keyboard_device_test();
#line 3 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\pcf8575.ino"
void pcf8575_begin();
#line 7 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\pcf8575.ino"
void pcf8575_writeAll(uint16_t data);
#line 14 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\pcf8575.ino"
void pcf8575_readAll();
#line 9 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_bt.ino"
void bt_test();
#line 54 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_bt.ino"
void bt_work(void *pvParameters);
#line 258 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_bt.ino"
bool joker_bt_start();
#line 280 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_bt.ino"
void joker_bt2usb();
#line 4 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\save.ino"
void save_config();
#line 15 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\save.ino"
void load_config();
#line 3 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\scan.ino"
void scan_start();
#line 18 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\scan.ino"
void key_scan_once();
#line 43 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\scan.ino"
void key_scan();
#line 14 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\poker_keyboard.ino"
void setup() {
  // DBG 设置
  Serial.begin(115200);
  Serial.println("Joker setting up!");
  delay(100);

  //读取保存的数据
  load_config();
  DFT_BOOT_MODE = Keyboard_Config.BOOT_MODE ;
  Serial.println(String(DFT_BOOT_MODE));
  Serial.println(String(Keyboard_Config.Version_KBD));
  // I2c 设置
  #ifdef Joker
  Wire.begin(21,22);
  Serial.println("I2C SET!");
  #endif
  
  //初始化扫描工作
  scan_start();
  Serial.println("SCAN SET!");

  // 9328USB输出
  #ifdef Joker
  Serial2.begin(115200, SERIAL_8N1, 17, 16); 
  #endif
  #ifdef MasterYoda
  Serial2.begin(115200, SERIAL_8N1, 16, 17);
  #endif

  delay(100);
  Serial.println("USB SET!");

  //键盘硬件设置
  keyboard_setup();
  Serial.println("Joker setted up!");

  if(DFT_BOOT_MODE == 0){
    joker_usb_start();
    //joker_usb_work();
  }
  if(DFT_BOOT_MODE == 1){
    //joker_bt_start();
  }
  //cnt_start();
}

void loop() {
  // put your main code here, to run repeatedly:
tm1637.display(2, (8));
    tm1637.display(3, (8));
  delay(1000);
}

#line 1 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\Seg_disp.ino"
#include "Seg_disp.h"

void init_seg(){
    tm1637.init();
    tm1637.set(BRIGHT_TYPICAL);//BRIGHT_TYPICAL = 2,BRIGHT_DARKEST = 0,BRIGHTEST = 7;
    tm1637.display(0, (8));
    tm1637.display(1, (8));
    tm1637.display(2, (8));
    tm1637.display(3, (8));
    tm1637.point(0);
    Serial.println("Seg ON");
    delay(200);
}
#line 1 "d:\\Data\\esp32_keyboard\\Keyboard_code\\poker_keyboard\\joker_usb.ino"
#include "joker_usb.h"
#include "scan.h"
#include "oled_buff.h"
#include "keyboard_self.h"
#include "poker_bt.h"
#include "save.h"
#include "esp32-hal.h"
#include "Layout.h"


void joker_usb_test(){
    if (key_code[2] == 0x00){
        key_code[2] = KEY_USB_A;
        Serial.println("set");
    }
    delay(100);
    Serial2.write(key_code,8);

    key_code[2] = 0x00;
    delay(1000);
    Serial2.write(key_code,8);
    
    Serial.println("sending");
    
}

void joker_usb_work(void *pvParameters){
    bool start_flag = 0;
    bool usb_send = 0;
    for (int i = 0; i < 8; i++)
    {
        key_code[i] = 0x00;
    }

    #ifdef Joker
    LineDisp("<MODE>===========USB", ble_line);
    LineDisp("<FN>----------------------------OFF", fn_line);
    display.drawString(0, ble_line*8 ,"<MODE>===========USB");
    display.display();
    #endif

    int start_time = micros();
    
    for (;;){
        

        key_scan();

        //PN位置
        #ifdef Joker
        //PN按下
        if(pn_stat){//pn被按下
            if ((key_press[LED_ROW][LED_COL]==0)&&(old_key_press[LED_ROW][LED_COL]==1)){ //LED 控制
                if(!LED_STAT){
                    open_inter_led();
                    //draw_dog();
                }
                else{
                    close_inter_led();
                }
            }//LED 控制

